Repository: T1000-Swift-Hail/PROJECT-2
Catalog: Bookstore App/Bookstore App/*.lproj/Main.strings
Languages: ar

# 20Y-QL-B5K.title
source: Home
ar: القائمة الرئيسية

# 6LR-sI-VmT.configuration.title
source: NEXT
ar: التالي

# Alc-3a-LHh.headerTitle
source: Address ...
ar: العنوان

# BPh-fo-LTu.configuration.title
source: New Joining
ar: إنضمام جديد

# Gul-eQ-qgh.text
source: Hello Dear, Welcome in the free encyclopedia, We have three type of departments .
ar: مرحباً عزيزي ، وأهلاً بك في تطبيق الموسوعة الحرة المكون من ثلاث أقسام ..

# QH1-gr-Id5.configuration.title
source: Join As Visiter
ar: الإنضمام كزائر

# Zad-vw-qdv.placeholder
source: Confirm New Password ...
ar: تآكيد رمز الدخول

# a1A-JR-76l.placeholder
source: Add New Password ...
ar: أدخل رمز الدخول

# h8m-wX-sh6.title
source: Home
ar: القائمة الرئيسية

# hIv-Ae-ZZF.headerTitle
source: User Name ...
ar: أسم المستخدم

# imH-1w-EU6.headerTitle
source: Connection ...
ar: وسائل التواصل

# jV1-eB-H8L.placeholder
source: Password ...
ar: رمز الدخول

# oVo-jj-lD9.placeholder
source: User Name ...
ar: أسم المستخدم

# oZY-Mt-tIA.placeholder
source: Add your Email Address ...
ar: البريد الألكتر،ني

# oow-b2-5uq.placeholder
source: Add Your City ...
ar: المدينة

# oz8-13-EpI.placeholder
source: Add Your Phone Number ...
ar: رقم الجوال

# pwd-aG-2QZ.placeholder
source: Add New User Name ...
ar: أسم المستخدم الجديد

# uXZ-wN-7VA.headerTitle
source: Password ...
ar: رمز الدخول

# wCQ-cZ-hj2.text
source: Login
ar: تسجيل الدخول

# zrB-1s-F5q.placeholder
source: Add Your Country ...
ar: الدولة
