Repository: T1000-Swift-Hail/PROJECT-2
Catalog: Bookstore App/Bookstore App/font/*.lproj/Localizable.strings
Languages: ar

source: Your Username And Password not corect
ar: أسم المستخدم و رمز الدخول غير صحيح

source: try Again
ar: حاول مره أخرى

source: Medical scientists
ar: علماء الطب

source: Theories
ar: علماء الفيزياء

source: Poetry
ar: علماء الفلك

source: Abu Bkr
ar: أبو بكر الرازي

source: Login
ar: تسجيل دخول

source: Abu Bakr Muhammad ibn Yahya ibn Zakaria al-Razi (250 AH/864 AD - 5 Shaban 311 AH / November 19, 923 AD) was a Muslim physician, chemist, philosopher and mathematician[2] who was one of the scholars of the golden age of science. humanity at all”, where he wrote the book Al-Hawi fi al-Tibb, which included all medical knowledge from the days of the Greeks until 925 AD and remained the main medical reference in Europe for 400 years after that date [3] and studied mathematics, medicine, philosophy, astronomy, chemistry, logic and literature.
ar: بو بَكر مُحَمَّد بن يَحْيَى بن زَكَرِيّا الرَّازِيّ (250 هـ/864 م - 5 شعبان 311هـ/19 نوفمبر 923م) طبيبٌ وكيميائي وفيلسوف ورياضيّاتيٌّ مسلم[2] من علماء العصر الذهبي للعلوم، وصفته سيغريد هونكه في كتابها شمس العرب تسطع على الغرب «أعظم أطباء الإنسانية على الإطلاق» ، حيث ألف كتاب الحاوي في الطب، الذي كان يضمُّ كل المعارف الطبية منذ أيام الإغريق حتى عام 925م وظل المرجع الطبي الرئيسي في أوروبا لمدة 400 عام بعد ذلك التاريخ [3] درس الرياضيات و‌الطب و‌الفلسفة و‌الفلك و‌الكيمياء و‌المنطق و‌الأدب.

source: Ibn Sina
ar: آبن سينا

source: Abu Ali al-Husayn ibn Abdullah ibn al-Hasan ibn Ali ibn Sina al-Balkhi and then al-Bukhari[3] known as Ibn Sina, a Muslim scholar and physician[4], was famous for medicine and philosophy and worked in them. He was born in the village of Afshna near Bukhara (in present-day Uzbekistan) to a father from the city of Balkh (in present-day Afghanistan) [5] and a village mother. He was born in the year 370 AH (980 AD) and died in Hamadan (in present-day Iran) in the year 427 AH (1037 AD). He was known as the chief Sheikh and Westerners called him the Prince of Physicians and the Father of Modern Medicine in the Middle Ages.
ar: أبو عَلْي الحُسَيْنَ بن عَبد الله بن الحسَنَ بن عَلْي بن سِينَا البَلْخيّ ثم البُخاريّ[3] المعروف بابن سينا، عالم وطبيب مسلم[4]، اشتهر بالطب والفلسفة واشتغل بهما. ولد في قرية أفشنة بالقرب من بخارى (في أوزبكستان حالياً) من أب من مدينة بلخ (في أفغانستان حالياً) [5] وأم قروية. ولد سنة 370 هـ (980م) وتوفي في همدان (في إيران حاليا) سنة 427 هـ (1037م). عُرف بأسم الشيخ الرئيس وسماه الغربيون بأمير الأطباء وأبو الطب الحديث في العصور الوسطى. وقد ألّف 200 كتابا في مواضيع مختلفة، العديد منها يركّز على الفلسفة والطب.

source: Ibn al-Nafees
ar: آبن النفيس

source: Abu al-Hassan Ala’ al-Din Ali ibn Abi al-Hazm al-Khalidi al-Makhzumi[5] al-Qurashi al-Dimashqi, nicknamed Ibn al-Nafis, and sometimes known as al-Qurashi in Fath al-Qaf wa al-Ra’ in relation to the Quraish tribe, (607AD), AH 687/12 [687] He is a Muslim physician, who has made many contributions to medicine, and is considered the discoverer of the microcirculation,[8] and one of the pioneers of human physiology, as he developed theories that scientists have relied on until now. He was appointed chief of doctors in Egypt.[9][10] He is considered by many to be the greatest physiologist of the Middle Ages.[11] The West continued to rely on its theory of blood circulation, until William Harvey discovered the Great Circulation.[12]
ar: أبو الحَسَن عَلاَءُ الدِّينِ عَلْي بن أبي الحَزم الْخَالِدِيّ المَخزُومَي[5] القََرَشي الدِّمَشْقِيّ الملقب بابن النفيس ويعرف أحيانًا بالقَرَشي بفتح القاف والراء نسبة إلى قبيلة قريش العربية[6][7] (607هـ/1213م، دمشق - 687هـ/1288 م) هو عالم موسوعي وطبيب مسلم، له إسهامات كثيرة في الطب، ويعتبر مكتشف الدورة الدموية الصغرى،[8] وأحد رواد علم وظائف الأعضاء في الإنسان، حيث وضع نظريات يعتمد عليها العلماء إلى الآن. عين رئيسًا لأطباء مصر.[9][10] ويعتبره كثيرون أعظم فيزيولوجيّي العصور الوسطى.[11] ظل الغرب يعتمدون على نظريته حول الدورة الدموية، حتى اكتشف ويليام هارفي الدورة الدموية الكبرى.[12]

source: Alhasan bn Alhaytham
ar: الحسن آبن الهيثم

source: abu ealy alhasan bn alhasan bn alhaytham (354 ha/965mi-430 ha/1040m) ealim musueii[5] eirbii[6][7][8][9][10] muslim qadam 'iishamat kabiratan fi alriyadiaat walbasariaat walfizia' waeilm alfalak walhandasat watibi aleuyun walfalsafat aleilmiat wal'iidrak albasarii waleulum bisifat eamat bitajaribih alati 'ajraha mstkhdman almanhaj aleilmi, walah aleadid min almualafat walmuktashafat aleilmiat alati 'akadaha aleilam alhadithu.[11]sahah abn alhaytham baed almafahim alsaayidat fi dhalik alwaqt aetmadan ealaa nazariaat 'aristu wabitlimus wa'iiqlidis,[12] fa'athbat aibn alhaytham haqiqatan 'ana aldaw' yati min al'ajsam 'iilaa aleayni, walays aleaks kama sad alaietiqad anadhak, wa'iilayh tunsb mabadi aikhtirae alkamira, wahu 'awal min shrrh aleayn tshryhaan kamlaan wawadah wazayif 'aedayiha, wahu 'awal min dars altaathirat waleawamil alnafsiat lil'iibsari.
ar: أبو عَلْي الحَسَن بن الحَسَن بن الهَيْثَم (354 هـ/965م-430 هـ/1040م) عالم موسوعي[5] عربي[6][7][8][9][10] مسلم قدم إسهامات كبيرة في الرياضيات والبصريات والفيزياء وعلم الفلك والهندسة وطب العيون والفلسفة العلمية والإدراك البصري والعلوم بصفة عامة بتجاربه التي أجراها مستخدمًا المنهج العلمي، وله العديد من المؤلفات والمكتشفات العلمية التي أكدها العلم الحديث.[11] صحح ابن الهيثم بعض المفاهيم السائدة في ذلك الوقت اعتمادًا على نظريات أرسطو وبطليموس وإقليدس،[12] فأثبت ابن الهيثم حقيقة أن الضوء يأتي من الأجسام إلى العين، وليس العكس كما ساد الاعتقاد آنذاك، وإليه تُنسب مبادئ اختراع الكاميرا، وهو أول من شرّح العين تشريحاً كاملاً ووضح وظائف أعضائها، وهو أول من درس التأثيرات والعوامل النفسية للإبصار.

source: abu alrayhan albiruni
ar: أبو الريحان البيروني

source: abu alrayhan muhamad bn 'ahmad albiruni (2 dhu alhijat 362h /5 sibtambar 973m- 29 jamadaa alakhirat 440hi/9 disambir 1048ma) hu bahith muslim [4][5][6][7][8] kan rhhaltan wfylswfan wflkyan wjghrafyan wjywlwjyan wryadyatyan wsydlanyan wmwrkhan wmtrjman. wusif bi'anah min bayn 'aezam aleuqul alati earafatha althaqafat al'iislamiatu, waqad qal bidawaran al'ard hawl mihwariha fi kitabih : miftah eilm alfalaki,[9] kama sanif ktban tarbu ean almiayat waleishrina.yuetbr albayruniu wahdan min 'aezam aleulama' aladhin earafahum aleasr al'iislamiu fi alqurun alwustaa, shamilat maerifatah alfizia' walriyadiaat waleulum altabieiata, wakan lah makanat marmuqat mwrkhaan waealam lughawiaat waealam tasalsul zamni.[10] daras albayruniu kula majalat aleulum tqryban, wakufi jaza' 'abhathih waeamalah alshaaqa.[11]
ar: أَبُو الرَّيْحَانِ مُحَمَّدٌ بْنُ أَحْمَدَ البِيرُونِيّ (2 ذو الحجة 362هـ /5 سبتمبر 973م— 29 جمادى الآخرة 440هـ/9 ديسمبر 1048م) هو باحث مسلم [4][5][6][7][8] كان رحّآلةً وفيلسوفًا وفلكيًا وجغرافيًا وجيولوجيًا ورياضياتيًا وصيدلانيًا ومؤرخًا ومترجمًا. وصف بأنه من بين أعظم العقول التي عرفتها الثقافة الإسلامية، وقد قال بدوران الأرض حول محورها في كتابه : مفتاح علم الفلك،[9] كما صنف كتبًا تربو عن المائة والعشرين. يُعتبر البيروني واحدًا من أعظم العلماء الذين عرفهم العصر الإسلامي في القرون الوسطى، شملت معرفته الفيزياء والرياضيات والعلوم الطبيعية، وكان له مكانة مرموقة مؤرخاً وعالم لغويات وعالم تسلسل زمني.[10] درس البيروني كل مجالات العلوم تقريبًا، وكوفئ جزاء أبحاثه وعمله الشاق.[11]

source: Abu Yuseff Alkinidi
ar: أبو يوسف الكندي

source: abu ywsuf yaequb bn 'iishaq alkinidy (185 ha/805 - 256 ha/873) ealamat earabiun muslami, burie fi alfalak walfalsafat walkimia' walfizia' waltibi walriyadiaat walmusiqaa waeilm alnafs walmantiq aladhi kan yueraf bieilm alkalami. yueraf eind algharb biasm (biallaatiniati: Alkindus), wayueadu alkanadiu 'awal alfalasifat almashshayiyn almuslimina, kama aushtuhir bijuhudih fi taerif alearab walmuslimin bialfalsafat alyunaniat alqadimat walhilinistiati.
ar: أبو يوسُف يَعْقُوب بن إِسْحَاق الْكِنِدي (185 هـ/805 - 256 هـ/873) علامة عربي مسلم، برع في الفلك والفلسفة والكيمياء والفيزياء والطب والرياضيات والموسيقى وعلم النفس والمنطق الذي كان يعرف بعلم الكلام. يعرف عند الغرب باسم (باللاتينية: Alkindus)، ويعد الكندي أول الفلاسفة المَشّائِين المسلمين، كما اشتهر بجهوده في تعريف العرب والمسلمين بالفلسفة اليونانية القديمة والهلنستية.

source: Bin Rushd
ar: آبن رشد

source: abu alwalid muhamad bin 'ahumid bin muhamad bin 'ahumid bin 'ahumid bin rushd (520 ha- 595 ha) yusamiyh al'uwrubiyuwn Averroes waushtuhir biasm abn rushd alhafid[7] (mawalid 14 'iibril 1126m, qurtubat - tuufiy 10 disambir 1198m, maraksh) hu faylasuf watabib wafaqih waqadi wafalakiun wafizyayiyun earabiun muslim 'andilsi. nasha fi 'usrat min 'akthar al'usr wajahatan fi al'andalus walati eurifat bialmadhhab almaliki, hifz muataa al'iimam maliki, wadiwan almutanabi.[8] wadars alfiqh ealaa almadhhab almalikii waleaqidat ealaa almadhhab al'ashearii.[9] yueadu abn rushd min 'ahami falasifat al'iislami. dafie ean alfalsafat wasahah lileulama' wafalasifatan sabiqin lah kabn sina walfarabi fahum baed nazariaat 'aflatun wa'aristu. qadamah aibn tufayl li'abi yaequb khalifat almuahidin faeaynuh tbybaan lah thuma qadyaan fi qurtba
ar: أبو الْوَلِيد مُحَمَّد بن أَحُمِّد بن مُحَمَّد بن أَحُمِّد بن أَحُمِّد بن رُشْد (520 هـ- 595 هـ) يسميه الأوروبيون Averroes واشتهر باسم ابن رُشْد الحفيد[7] (مواليد 14 إبريل 1126م، قرطبة - توفي 10 ديسمبر 1198م، مراكش) هو فيلسوف وطبيب وفقيه وقاضي وفلكي وفيزيائي عربي مسلم أندلسي. نشأ في أسرة من أكثر الأسر وجاهة في الأندلس والتي عرفت بالمذهب المالكي، حفظ موطأ الإمام مالك، وديوان المتنبي.[8] ودرس الفقه على المذهب المالكي والعقيدة على المذهب الأشعري.[9] يعد ابن رشد من أهم فلاسفة الإسلام. دافع عن الفلسفة وصحح للعلماء وفلاسفة سابقين له كابن سينا والفارابي فهم بعض نظريات أفلاطون وأرسطو. قدمه ابن طفيل لأبي يعقوب خليفة الموحدين فعينه طبيباً له ثم قاضياً في قرطبة

source: jabr bin hyan
ar: جابر ابن حيان

source: jabr bin hyan bin eabd allh al'azdiu ealim muslim earbii,[3][4][5][6] akhtulif min 'ayi butun al'azd yunsab. burie fi eulum alkimia' walfalak walhandasat waeilm almaeadin walfalsafat waltibi walsaydalati, wyued jabir bin hyan 'awal man astakhdam alkimia' emlyan fi altaarikhi.[7]wulid ealaa 'ashhar alriwayat fi sanat 101hi/ 721ma[8] waqil aydaan 117hi/ 737ma[9] ealim earabiun waqad aikhtalafat alriwayat ealaa tahdid makan mawalidih famin almuarikhin man yaqul bi'anah min mawalid aljazirat ealaa alfurat sharq bilad alshaami, waminhum man yaqul 'ana 'aslah min madinat haraan fi bilad ma bayn alnahrayn walaeala hadha alaintisab natij ean tashabuh fi al'asma' fajabir almansub 'iilaa al'andalus hu alealam alfalakiu alearabiu jabir bin 'aflah aladhi wulid fi 'iishbiliat waeash fi alqarn althaani eashar almiladii
ar: جَابر بن حيّان بن عبد الله الأَزْدِيُّ عالم مسلم عربي،[3][4][5][6] اختُلِفَ من أي بُطُونِ الأزد يُنسَب. برع في علوم الكيمياء والفلك والهندسة وعلم المعادن والفلسفة والطب والصيدلة، ويُعد جابر بن حيّان أول من استخدم الكيمياء عمليًا في التاريخ.[7] ولد على أشهر الروايات في سنة 101هـ/ 721م[8] وقيل أيضاً 117هـ/ 737م[9] عالم عربي وقد اختلفت الروايات على تحديد مكان مولده فمن المؤرخين من يقول بأنه من مواليد الجزيرة على الفرات شرق بلاد الشام، ومنهم من يقول أن أصله من مدينة حران في بلاد ما بين النهرين ولعل هذا الانتساب ناتج عن تشابه في الأسماء فجابر المنسوب إلى الأندلس هو العالم الفلكي العربي جابر بن أفلح الذي ولد في إشبيلية وعاش في القرن الثاني عشر الميلادي.

source: iibrahim alfazari
ar: إبراهيم الفزاري

source: bu 'iishaq 'iibrahim bin habib bin sulayman bin samrat bin jandab alfazari, tuafaa sanatan 777ma. yueadu 'awal falakiin earabiin sune al'asturlab wakatab eanh waean altaqwimi. wahu min walad alsahabii samrat bin jandab, wasahib kitab alziyj ealaa suniy alearabi, hayth aistukhrij jdwlaan hsabyaan flkyaan yubayin mawaqie alnujum wahisab harakatiha wahu ma eurif bialziyji.[1]waladuh hu 'abu eabd allah muhamad bin 'iibrahim alfazari. wakan yaequb bin tariq wamuhamad bin 'iibrahim alfizarii ealaa eilm bialriyadiaat alhandasiati. qabil al'awal fi balat almansur falakia hindiana yudeaa kanahaha, raghabah fi kitab alsaadihanit fa'amr muhamad bitarjamatihi.
ar: بو إسحاق إبراهيم بن حبيب بن سليمان بن سمرة بن جندب الفزاري، توفى سنة 777م. يعد أول فلكي عربي صنع الأسطرلاب وكتب عنه وعن التقويم. وهو من ولد الصحابي سمرة بن جندب، وصاحب كتاب الزيج على سني العرب، حيث استخرج جدولاً حسابياً فلكياً يبين مواقع النجوم وحساب حركاتها وهو ما عرف بالزيج.[1] ولده هو أبو عبد الله محمد بن إبراهيم الفزاري. وكان يعقوب بن طارق ومحمد بن إبراهيم الفزاري على علم بالرياضيات الهندسية. قابل الأول في بلاط المنصور فلكيا هنديا يدعى كانهه، رغبه في كتاب السادهانت فأمر محمد بترجمته.
